Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Before you call a method on an object's delegate, make sure that the delegate isn't nil.
ja: あなたがメソッドをオブジェクトの持つ委任先で呼び出す前に、委任先がnilでないことを確実にしてください。

source: Bidirectional collections can therefore offer additional operations, such as a last property that provides efficient access to the last element and a reversed() method that presents the elements in reverse order.
ja: 二方向性のコレクションは、従って追加の演算を提案します、例えば最後の要素への手際のよいアクセスを提供するlastプロパティ、そして要素を逆順で提示するreversed()メソッドなど。

source: Bidirectional collections offer traversal backward from any valid index, not including a collection’s startIndex.
ja: 二方向性のコレクションは、あらゆる有効な、しかしコレクションのstartIndexを含まないインデックスから後方へ辿っていくことを提案します。

source: BidirectionalCollection Implementations
ja: 双方向コレクションの実装

source: Binary Integer Operators
ja: ２進整数演算子

source: BinaryFloatingPoint Implementations
ja: バイナリ浮動小数点の実装

source: BinaryInteger Implementations
ja: バイナリ整数の実装

source: Bit Fields
ja: ビットフィールド

source: Bit Pattern Conversion
ja: ビットパターン変換

source: Bit Shift
ja: ビットシフト

source: Bitwise Operations
ja: ビット単位演算

source: Bitwise conversion from one integer type to another.
ja: ある整数型から別のものへのビット単位変換。

source: Both of these methods return the original, unwrapped type of the object.
ja: これらのメソッドの両方とも、元の、オブジェクトのアンラップされた型を返します。

source: Both parameters must be valid indices of the collection and not equal to endIndex.
ja: 両方のパラメータは、このコレクションの有効なインデックスであり、endIndexと等しくない必要があります。

source: Both parameters must be valid indices of the collection that are not equal to endIndex.
ja: 両方のパラメータは、このコレクションの有効なインデックスで、endIndexと等しくない必要があります。

source: Both processes are described below.
ja: 双方の行程は下で記述されます。

source: Bridging Between Array and NSArray
ja: ArrayとNSArrayの間のブリッジ

source: Bridging Between Dictionary and NSDictionary
ja: DictionaryとNSDictionaryの間のブリッジ

source: Bridging from Array to NSArray takes O(1) time and O(1) space if the array’s elements are already instances of a class or an @objc protocol; otherwise, it takes O(n) time and space.
ja: ArrayからNSArrayへのブリッジは、配列のもつ要素がすでにあるクラスまたは@objcプロトコルのインスタンスであるならば、O(1)時間とO(1)空間をとります；そうでなければ、それはO(n)の時間と空間をとります。

source: Bridging from Dictionary to NSDictionary always takes O(1) time and space.
ja: DictionaryからNSDictionaryへのブリッジは、常にO(1)時間と空間をとります。

source: Bridging from NSDictionary to Dictionary first calls the copy(with:) method (- copyWithZone: in Objective-C) on the dictionary to get an immutable copy and then performs additional Swift bookkeeping work that takes O(1) time.
ja: NSDictionaryからDictionaryへのブリッジは、最初にcopy(with:)メソッド（Objective-Cでの- copyWithZone:）をその辞書上で呼び出して可変のコピーを取得して、それからO(1)時間を取る追加的なSwift簿記作業を実行します。

source: Build apps using a powerful open language.
ja: 強力でオープンな言語を使ってアプリを作成します。

source: By default this limit is unlimited.
ja: 初期状態ではこの限界は、制限されません。

source: By default, a collection conforms to the Sequence protocol by supplying IndexingIterator as its associated Iterator type.
ja: 初期状態で、あるコレクションはSequenceプロトコルに、IndexingIteratorをそれの関連Iterator型として提供することによって準拠します。

source: By default, any custom collection type you create will inherit a makeIterator() method that returns an IndexingIterator instance, making it unnecessary to declare your own.
ja: 初期状態で、あなたが作成するあらゆるあつらえのコレクション型は、IndexingIteratorインスタンスを返すmakeIterator()メソッドを継承していて、それをあなた自身で宣言する必要がないようにしています。

source: By default, the generated header contains interfaces for Swift declarations marked with the public or open modifier.
ja: 特に何もしなければ、生成されたヘッダはpublicまたはopen修飾子で印されたSwift宣言を含みます。

source: By default, this name is the same as your product name, with any nonalphanumeric characters replaced with an underscore (_).
ja: 省略時には、この名前は、あらゆる非アルファベット文字がアンダースコア（_）で置き換えられたあなたの製品名と同じです。

source: C struct and union types can define fields that have no name or that are of an unnamed type.
ja: Cのstructとunion型は、名前を持たないまたは無名型であるフィールドを定義できます。

source: C APIs
ja: C API

source: C Interoperability
ja: C互換性

source: C Syntax
ja: C構文

source: C Variadic Functions
ja: C可変長引数関数

source: C and Objective-C Pointers
ja: CおよびObjective-Cポインタ

source: C function pointers are imported into Swift as closures with the C function pointer calling convention, denoted by the @convention(c) attribute.
ja: C関数ポインターは、@convention(c)属性によって示される、C関数呼出規約を持つクロージャとしてSwiftにインポートされます。

source: C functions that use the ... syntax for variadic arguments are not imported, and therefore can’t be called using CVarArg arguments.
ja: ...構文を可変長引数に使うC関数はインポートされません、そしてそれゆえCVarArg引数を使って呼び出されることができません。

source: C macros that are more complex than simple constant definitions have no counterpart in Swift.
ja: 単純な定数宣言よりもっと複雑なCマクロは、相当するものをSwiftにおいて持ちません。

source: Calculates the additive inverse of a value.
ja: ある値の加法の逆元を計算します。

source: Calculates the result of shifting a value’s binary representation the specified number of digits to the right, masking the shift amount to the type’s bit width, and stores the result in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を計算します、シフト量をその型のもつビット幅にマスクしています、そして結果を左手側の変数に格納します。

source: Calculating count can be an O(n) operation.
ja: countの算出は、O(n)演算であるはずです。

source: Call body(p), where p is a pointer to the collection’s contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ隣接ストレージへのポインタです。

source: Call body(p), where p is a pointer to the collection’s mutable contiguous storage.
ja: body(p)を呼び出します、ここでpはコレクションのもつ可変の隣接ストレージへのポインタです。

source: Call firstIndex(where:) again, this time on the slice created in step 2.
ja: firstIndex(where:)もう一度呼び出します、今回は手順にで作成したスライス上で。

source: Call firstIndex(where:) to find the index of the first element in the absences array that is greater than zero.
ja: firstIndex(where:)を呼んでabsences配列の中の、ゼロより大きい最初の要素がもつインデックスを手に入れてください。

source: Call randomElement() to select a random element from an array or another collection.
ja: randomElement()を呼び出して、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call randomElement(using:) to select a random element from an array or another collection when you are using a custom random number generator.
ja: randomElement(using:)を呼び出して、あなたがあつらえの無作為数生成子を使っている場合に、ある無作為な要素を配列または別のコレクションから選んでください。

source: Call hasher.combine(_:) with each of these components.
ja: hasher.combine(_:)をそれら構成要素とともに呼び出してください。

source: Call Functions with Pointer Parameters
ja: 関数をポインタパラメータを使って呼び出す

source: Callers should apply the same preconditions to the return value as they would to a range provided directly by the user.
ja: 呼び出し側は、同じ前提条件を戻り値に適用すべきです、それらがユーザによって直接に提供される範囲にするように。

source: Calling appending(path:) results in the same key path as if the given key path had been specified using dot notation.
ja: appending(path:)を呼び出すことは、与えられたキーパスがドット表記法を使って指定された場合と同じキーパスという結果になります。

source: Calling checkCancellation() on the Task, which throws a CancellationError.
ja: checkCancellation()をTask上で呼び出す、それはCancellationErrorをスローします。

source: Calling swapAt(_:_:) with the same index as both i and j has no effect.
ja: swapAt(_:_:)をiとj両方で同じインデックスで呼び出すことは、効果を持ちません。

source: Calling Objective-C APIs Asynchronously
ja: Objective-C APIを非同期に呼び出す

source: Calling the dump(_:_:_:_:) function and printing in the debugger uses both String(reflecting:) and Mirror(reflecting:) to collect information about an instance.
ja: dump(_:_:_:_:)関数を呼び出してデバッガに出力することは、String(reflecting:)とMirror(reflecting:)の両方を使ってインスタンスの情報を収集します。

source: Calling the numericCast(_:) function is equivalent to calling an initializer for the destination type.
ja: numericCast(_:)関数を呼び出すことは、行き先型に対するイニシャライザを呼び出すことに等しいです。

source: Calling the reserveCapacity(_:) method on a dictionary with bridged storage triggers a copy to contiguous storage even if the existing storage has room to store minimumCapacity key-value pairs.
ja: reserveCapacity(_:)メソッドをブリッジされたストレージを持つ辞書で呼び出すことは、隣接ストレージへのコピーを引き起こします、たとえ既存のストレージにminimumCapacityキー値ペアを格納する余地があるとしてもです。

source: Calling the reserveCapacity(_:) method on an array with bridged storage triggers a copy to contiguous storage even if the existing storage has room to store minimumCapacity elements.
ja: reserveCapacity(_:)メソッドをブリッジされたストレージを持つ配列で呼び出すことは、隣接ストレージへのコピーを引き起こします、たとえ既存のストレージにminimumCapacity要素を格納する余地があるとしてもです。

source: Calling the removeSubrange(_:) method instead is preferred.
ja: removeSubrange(_:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the insert(contentsOf:at:) method instead is preferred.
ja: insert(contentsOf:at:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the function with different class types shows how the getDefaultValue() class method is only conditionally available.
ja: この関数を異なるクラス型で呼び出すことは、どのようにgetDefaultValue()クラスメソッドが条件付きでのみ利用可能であるのかを示します。

source: Calling the related sorted() method is equivalent to calling this method and passing the less-than operator (<) as the predicate.
ja: 関連したsorted()メソッドを呼び出すことは、このメソッドを呼び出して、より小さい演算子（<）を述部として渡すことと等しいです。

source: Calling this function breaks the guarantees of the Swift type system; use with extreme care.
ja: この関数を呼ぶことは、Swift型システムの保証を壊します；最大限の注意を払ってください。

source: Calling this function more than once is idempotent; i.e. finishing more than once does not alter the state beyond the requirements of AsyncSequence; which claims that all values past a terminal state are nil.
ja: この関数を一回以上呼び出すことは冪等です；すなわち、一回以上終了することはAsyncSequenceの要件を越えてその状態を改めません；それは終端状態を過ぎた全ての値はnilであると主張します。

source: Calling this method invalidates all indices with respect to the dictionary.
ja: このメソッドを呼び出すことは、この辞書に関するすべてのインデックスを無効にします。

source: Calling this method invalidates any existing indices for use with this dictionary.
ja: このメソッドを呼び出すことは、この辞書で使うためのあらゆる既存のインデックスを無効にします。

source: Calling this method may invalidate all saved indices of this collection.
ja: このメソッドを呼び出すことは、このコレクションの全ての保存されたインデックスを無効にします。

source: Calling this method may invalidate any existing indices for use with this collection.
ja: このメソッドを呼び出すことは、このコレクションで使うためのあらゆる既存のインデックスを無効にします。

source: Calling this property directly is discouraged.
ja: このプロパティを直接に呼び出すことは、推奨されません。

source: Calls a closure with a pointer to the array’s contiguous storage.
ja: あるクロージャを配列のもつ隣接ストレージへのポインタとともに呼び出します。

source: Calls the given closure on each element in the sequence in the same order as a for-in loop.
ja: 指定されたクロージャをそのシーケンスの各要素上でfor-inループと同じ順番で呼び出します。

source: Calls the given closure with a mutable pointer to the given argument.
ja: 与えられたクロージャを与えられた引数に対する可変ポインタを使って呼び出します。

source: Calls the given closure with a pointer to the array’s mutable contiguous storage.
ja: 与えられたクロージャを配列のもつ可変の隣接ストレージへのポインタとともに呼び出します。

source: Calls the given closure with a pointer to the underlying bytes of the array’s contiguous storage.
ja: 与えられたクロージャを、配列の隣接ストレージの基礎をなすバイトへのポインタとともに呼び出します。

source: Calls the given closure with a pointer to the underlying bytes of the array’s mutable contiguous storage.
ja: 与えられたクロージャを、配列の可変の隣接ストレージの基礎をなすバイトへのポインタとともに呼び出します。

source: Calls the given closure with the with the “current” task in which this function was invoked.
ja: 与えられたクロージャを、それにおいてこの関数が発動されたところの “現在の” タスクで呼び出します。

source: Canceling Tasks
ja: タスクの取り消し

source: Canceling the task in which the group is running also cancels the group and all of its child tasks.
ja: その中においてグループが動作しているタスクを取り消すことはまた、そのグループと全てのそれの子タスクを取り消します。

source: Cancellation
ja: 取り消し

source: Cancelling an active iteration will first invoke the onTermination callback and then resume yeilding nil.
ja: 活動中の反復が取れ消されることは、最初にonTerminationコールバックを発動します、その次にnilを生み出すことを再開します。

source: Cast between a Swift value type and its corresponding reference type by using the as keyword.
ja: Swift値型とそれの対応する参照型の間でasキーワードを使ってキャストしてください。

source: Cast instances of the Objective-C id type to a specific Swift type.
ja: Objective-C idのインスタンスをSwift型にキャストします。

source: Casting AnyObject Instances to a Known Type
ja: AnyObjectインスタンスを既知の型へキャストする

source: Casting an instance of a reference type.
ja: 参照型のインスタンスのキャスト。

source: Casting is always safe in the context of a switch statement.
ja: キャストはswitch文の文脈においては常に安全です。

source: Catch Errors
ja: エラーをキャッチする

source: Cerating a Random Value
ja: 無作為な値を作成する

source: Check That Delegates Exist
ja: その委任先が存在するか確認する

source: Check if the task is cancelled and throw an CancellationError if it was.
ja: タスクが取り消されるかどうか確認します、そしてそれがそうであったならばCancellationErrorをスローします。

source: Checking a Character’s Case
ja: 文字のケースを確認する

source: Checking a Character’s Numeric Properties
ja: 文字の数値プロパティを確認する

source: Checking for Containment
ja: 制約を調べる

source: Checking the isCancelled value of the current Task inside next() and returning nil to terminate the sequence.
ja: next()の内部の現在のTaskのisCancelled値を調べるそしてnilを返してシーケンスを終端する。

source: Checks a necessary condition for making forward progress.
ja: これは進捗を前へ進めるために必要な条件を確認します。

source: Choose Structures by Default
ja: 構造体を通常は使ってください

source: Choosing Between Structures and Classes
ja: 構造体かクラスのいずれかを選ぶ

source: Choosing the Smallest and Largest Value
ja: 最小および最大値を選ぶ

source: Clamping Conversion
ja: 固定変換

source: Clamping a Range
ja: 範囲を固定する

source: Class clusters that include immutable and mutable subclasses, like NSArray and NSMutableArray, are bridged to a single value type.
ja: NSArrayおよびNSMutableArrayのような、不変および可変のサブクラスを含むクラスクラスタは、単一の値型にブリッジされます。

source: Class instance identity, on the other hand, is compared using the triple-equals identical-to operator (===).
ja: 一方、クラスインスタンス同一性は、３つの等号の同一性演算子（===）を使って比較されます。

source: Classes in Swift come with a built-in notion of identity because they're reference types.
ja: Swiftでのクラスそれらは、組み込みの同一性の概念を備えています、なぜならそれらが参照型だからです。

source: Classes specific to Objective-C or inherently tied to the Objective-C runtime, like NSObject, NSAutoreleasePool, NSException, and NSProxy
ja: Objective-C特有の、またはObjective-Cランタイムに本質的に結びつけられ切り離せないクラス、NSObject、NSAutoreleasePool、NSException、そしてNSProxyのような

source: Coalescing Nil Values
ja: nil値の合体

source: Cocoa APIs often provide protocols that include delegate methods.
ja: Cocoa APIは、しばしば委任先メソッドを含むプロトコルを提供します。

source: Cocoa Design Patterns
ja: Cocoaデザインパターン

source: Cocoa Frameworks
ja: Cocoaフレームワーク

source: Code outside the standard library can extend string interpolation on String and many other common types by extending DefaultStringInterpolation and adding an appendInterpolation(...) method.
ja: 標準ライブラリの外側のコードは、文字列補間をStringおよび多くの他の一般の型の上で拡張することが、DefaultStringInterpolationを拡張することそしてappendInterpolation(...)メソッドを加えることで可能です。

source: CodingKey Implementations
ja: コーディングキー実装

source: Collection Implementations
ja: コレクション実装

source: Collection Literals
ja: コレクションリテラル

source: Collection Traversal
ja: コレクション横断

source: Collections
ja: さまざまなコレクション

source: Collections are used extensively throughout the standard library.
ja: コレクションは標準ライブラリの至る所で広範囲にわたって使われます。

source: Combining Arrays
ja: 配列を結合する

source: Command Line Input
ja: コマンドライン入力

source: Command-line arguments for the current process.
ja: 現在のプロセスに対するコマンドライン引数。

source: Common Patterns
ja: 共通パターン

source: Common conversions supported by the Swift standard library include the following:
ja: Swift標準ライブラリによってサポートされる一般的な変換は、以下を含みます：

source: Common protocol to which all actors conform.
ja: それへと全てのアクターが準拠する共通プロコル。

source: Common use cases are file handles, network connections, and shared hardware intermediaries like CBCentralManager.
ja: 一般的な利用事例は、ファイルハンドル、ネットワーク接続、そしてCBCentralManagerのような共有ハードウェア仲介です。

source: Comparable Implementations
ja: Comparable実装

source: Comparable Requirements
ja: Comparable要件

source: Compare each significant property for equality in your == method's implementation:
ja: 重要なプロパティそれぞれを同等性についてあなたの==メソッドの実装において比較してください：

source: Compare tuples of between two and six Comparable elements using these comparative operators.
ja: ２つと６つの間のComparable要素のタプルをそれらの比較演算を使って比較します。

source: Compare tuples of between two and six Equatable elements for equality or inequality.
ja: ２つと６つの間のEquatable要素のタプルを同等性または不等性について比較します。

source: Comparing Across Integer Types
ja: さまざまな整数型を比較する

source: Comparing Arrays
ja: 配列の比較

source: Comparing Boolean Values
ja: ブール値を比較する

source: Comparing Characters
ja: 文字の比較

source: Comparing Dictionaries
ja: 辞書の比較

source: Comparing Identity
ja: 同一性の比較

source: Comparing Pointers
ja: ポインタを比較する

source: Comparing Ranges
ja: 範囲の比較

source: Comparing Ranges as Collections
ja: 範囲をコレクションとして比較する

source: Comparing Values
ja: 値の比較

source: Comparison
ja: 比較

source: Complexity: Amortized O(1) if the dictionary does not wrap a bridged NSDictionary.
ja: 計算量：この辞書が、ブリッジされたNSDictionaryをラップしないならば均してO(1)。

source: Complexity: Amortized O(1) if the dictionary does not wrap a bridged NSDictionary; otherwise, the performance is unspecified.
ja: 計算量：この辞書が、ブリッジされたNSDictionaryをラップしないならば均してO(1)；それ以外では、性能は不特定です。

source: Complexity: Averages to O(1) over many calls to popFirst().
ja: 計算量：多くのpopFirst()に対する呼び出しにわたって均してO(1)。

source: Complexity: O(1)
ja: 計算量：O(1)

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is equal to maxLength.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはmaxLengthに相当します。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the absolute value of distance.
ja: 計算量：もしコレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはdistanceの値の絶対値です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop from the beginning of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはコレクションの冒頭から除外する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkは除外される要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to remove.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは除去される要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to select from the beginning of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(k)、そこでkはコレクションの冒頭から選択する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the resulting distance.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは結果の隔たりです。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the specified number of elements.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkは指定した要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the absolute value of n.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(n)、そこでnはnの値の絶対値です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the length of the collection.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(n)、そこでnはコレクションの長さです。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the resulting distance.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(n)、そこでnは結果となる隔たりです。

source: Complexity: O(1) on average, over many calls to append(_:) on the same array.
ja: 計算量：同じ配列上でのappend(_:)への多くの呼び出しに対して、均してO(1)。

source: Complexity: O(1), except if the sequence also conforms to Collection.
ja: 計算量：O(1)、例外としてシーケンスが同様にCollectionに準拠する場合を除きます。

source: Complexity: O(1), with O(k) deferred to each iteration of the result, where k is the number of elements to drop from the beginning of the sequence.
ja: 計算量：O(1)、結果の各反復に対してO(k)延期されて、ここでkはシーケンスの冒頭から除かれる要素の数です。

source: Complexity: O(1).
ja: 計算量：O(1)。

source: Complexity: O(k), where k is the length of the result.
ja: 計算量：O(k)、ここでkは結果の長さです。

source: Complexity: O(k), where k is the number of elements to drop from the beginning of the sequence.
ja: 計算量：O(k)、ここでkはシーケンスの冒頭から除かれる要素の数です。

source: Complexity: O(k), where k is the specified number of elements.
ja: 計算量：O(k)、ここでkは指定された要素の数です。

source: Complexity: O(m + n), where m is the length of this sequence and n is the length of the result.
ja: 計算量：O(m + n)、ここでmはこのシーケンスの長さで、nは結果の長さです。

source: Complexity: O(m + n), where n is the length of the original dictionary and m is the length of the resulting dictionary.
ja: 計算量：O(m + n)、ここでnは元の辞書の長さで、mは結果の辞書の長さです。

source: Complexity: O(m + n), where n is the length of this sequence and m is the length of the result.
ja: 計算量：O(m + n)、ここでnはこのシーケンスの長さで、mは結果の長さです。

source: Complexity: O(m) on average, where m is the length of newElements, over many calls to append(contentsOf:) on the same array.
ja: 計算量：O(m)、ここでmはnewElementsの長さで、同じ配列上でのappend(contentsOf:)への多くの呼び出しに対してで。

source: Complexity: O(m), where m is the length of newElements.
ja: 計算量：O(m)、ここでmはnewElementsの長さです。

source: Complexity: O(m), where m is the length of the right-hand-side argument.
ja: 計算量：O(m)、ここでmは右手側の引数の長さです。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of other.
ja: 計算量：O(m)、ここでmはシーケンスの長さとotherの長さのより短い方です。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of possiblePrefix.
ja: 計算量：O(m)、ここでmはシーケスの長さとpossiblePrefixの長さのより短い方です。

source: Complexity: O(n * log(n)), where n is the length of the parameter.
ja: 計算量：O(n * log(n))、ここでnはパラメータの長さです。

source: Complexity: O(n + c), where n is self.count and c is the number of changes contained by the parameter.
ja: 計算量：O(n + c)、ここでnはself.countです、そしてcはパラメータによって含まれる変更の数です。

source: Complexity: O(n + m), where n is length of the array and m is the length of newElements.
ja: 計算量：O(n + m)、ここでnは配列の長さです、そしてmはnewElementsの長さです。

source: Complexity: O(n + m), where n is length of this collection and m is the length of newElements.
ja: 計算量：O(n + m)、ここでnは配列の長さです、そしてmはnewElementsの長さです。

source: Complexity: O(n log n), where n is the length of the collection.
ja: 計算量：O(n log n)、ここでnはコレクションの長さです。

source: Complexity: O(n log n), where n is the length of the sequence.
ja: 計算量：O(n log n)、ここでnはシーケンスの長さです。

source: Complexity: O(n)
ja: 計算量：O(n)

source: Complexity: O(n) where n is the number of collection differences.
ja: 計算量：O(n)、ここでnはコレクション差異それらの数です。

source: Complexity: O(n), where n is the length of the array.
ja: 計算量：O(n)、ここでnは配列の長さです。

source: Complexity: O(n), where n is the length of the collection.
ja: 計算量：O(n)、ここでnはコレクションの長さです。

source: Complexity: O(n), where n is the length of the dictionary.
ja: 計算量：O(n)、ここでnは辞書の長さです。

source: Complexity: O(n), where n is the length of the sequence.
ja: 計算量：O(n)、ここでnはシーケンスの長さです。

source: Complexity: O(n), where n is the number of elements in the array.
ja: 計算量：O(n)、ここでnは配列の中の要素数です。

source: Complexity: O(n), where n is the number of elements in the collection.
ja: 計算量：O(n)、ここでnはコレクションの中の要素数です。

source: Complexity: O(n), where n is the number of key-value pairs in the dictionary.
ja: 計算量：O(n)、ここでnは辞書の中のキー値ペアの数です。

source: Complexity: Reading an element from an array is O(1).
ja: 計算量：ある要素を配列から読み出すことはO(1)です。

source: Complexity: Worst case performance is O(n * m), where n is the count of this collection and m is other.count.
ja: 計算量：最悪の場合の性能は、O(n * m)です、ここでnはこのコレクションの総数です、そしてmはother.countです。

source: Conform Automatically to Equatable and Hashable
ja: 自動的にequatableとhashableに準拠する

source: Conform Manually to Equatable and Hashable
ja: 手動でequatableとhashableに準拠する

source: Conforming Types
ja: これらの型が準拠

source: Conforming to ExpressibleByArrayLiteral
ja: ExpressibleByArrayLiteralに準拠する

source: Conforming to ExpressibleByExtendedGraphemeClusterLiteral
ja: ExpressibleByExtendedGraphemeClusterLiteralに準拠する

source: Conforming to ExpressibleByFloatLiteral
ja: ExpressibleByFloatLiteralに準拠する

source: Conforming to ExpressibleByIntegerLiteral
ja: ExpressibleByIntegerLiteralに準拠する
